In [3]:
#importando biblioteca
import pandas as pd

In [8]:
#carregando arquivo apenas as colunas solicitadas
df = pd.read_csv('/content/AB_NYC_2019.csv', usecols = [0, 2, 9, 11, 12])

In [9]:
df.head()

     id  host_id  price  number_of_reviews last_review
0  2539     2787    149                  9  2018-10-19
1  2595     2845    225                 45  2019-05-21
2  3647     4632    150                  0         NaN
3  3831     4869     89                270  2019-07-05
4  5022     7192     80                  9  2018-11-19

In [10]:
#salvando em novo arquivo csv
df.to_csv(r'/content/colunas_selecionadas.csv', index = False)